// Описание задания
// Вывести на консоль текст “Hello World!”:
// 1. Скачать и установить IntelliJ IDEA.
// 2. Написать первую программу, которая выводит в консоль строку “Hello World!”.

package com.max.idea;

public class hello {
    public static void main(String[] args) {
        System.out.println("Hello World");
    }
}
